app/controllers/albums_controller.rb

SELECT "artists"."id" FROM "artists"
SELECT "albums"."id" FROM "albums"
SELECT "albums".* FROM "albums"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "QWRlbWFzIGRlIG1p"], ["LIMIT", 1]]
INSERT INTO "albums" ("id", "artist_id", "name", "genre", "artist_album", "tracks_album", "self_album", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_album
    if params[:name] != "" && params[:genre] != ""
      artist_id = params[:id]
      artistas = Artist.all.ids
      if artistas.include?(artist_id)
        name_album = params[:name].strip
        genre_album = params[:genre].strip
        id = Base64.encode64(name_album).strip
        albumnes = Album.all.ids
        if albumnes.include?(id)
          render json: Album.find(id), status: 409
        else
          album = Album.new
          album.id = id
          album.artist_id = artist_id
          album.name = name_album
          album.genre = genre_album
          album.artist_album = "artists/" + artist_id
          album.tracks_album = "albums/" + id + "/tracks"
          album.self_album = "albums/" + id

          if album.save

SELECT "albums".* FROM "albums"
---
  def index
    albums = Album.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "U295IFBlb3I="], ["LIMIT", 1]]
---
  def show
    album_id = Album.find(params[:id])

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", "VHJ1ZW5v"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "VGhZ28="], ["LIMIT", 1]]
---
  def show_albums
    albumnes = Artist.find(params[:id]).albums

SELECT "albums"."id" FROM "albums"
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = ?  [["album_id", "WUhMUU1ETEc="]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "WUhMUU1ETEc="], ["LIMIT", 1]]
---
  def play
    albumnes = Album.all.ids
    if albumnes.include?(params[:id])
      tracks = Album.find(params[:id]).songs

SELECT "albums"."id" FROM "albums"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "QWRlbWFzIGRlIG1p"], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", "QWRlbWFzIGRlIG1p"]]
---
  def delete
    albumnes = Album.all.ids
    if albumnes.include?(params[:id])
      album_delete = Album.find(params[:id])
      album_delete.destroy