app/controllers/artists_controller.rb

  def create_artist
    puts("-----------\n")
    puts(params[:name])
    puts("-----------\n")
    if params[:name] == "" || params[:age] == ""
      puts("error\n")
      return render json: [], status: 400
    else
      puts("2222\n")
      name_artist = params[:name].strip
      age_artist = params[:age].to_i
      id_artist= Base64.encode64(name_artist).strip
      artistas = Artist.all.ids
      puts (artistas)
      if artistas.include?(id_artist)
        render json: Artist.find(id_artist), status: 409
      else
        artist = Artist.new
        artist.name = name_artist
        artist.id = id_artist
        artist.age = age_artist
        artist.self_artst = "artists/" + id_artist
        artist.tracks_artist = "artists/" + id_artist + "/tracks"
        artist.albums_artist = "artists/" + id_artist + "/albums"
        if artist.save
---
SELECT "artists"."id" FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", ""], ["LIMIT", 1]]
INSERT INTO "albums" ("id", "artist_id", "name", "genre", "artist_album", "tracks_album", "self_album", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "artists" ("id", "name", "age", "albums_artist", "tracks_artist", "self_artst", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def index
    artists = Artist.all
---
SELECT "artists".* FROM "artists"

  def show
    artista = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "VHJ1ZW5v"], ["LIMIT", 1]]

  def play
    artistas = Artist.all.ids
    if artistas.include?(params[:id])
      albums = Artist.find(params[:id]).albums
---
SELECT "artists"."id" FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "QmFkIEJ1bm55"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", "QmFkIEJ1bm55"]]

  def delete
    artistas = Artist.all.ids
    if artistas.include?(params[:id])
      artist_delete = Artist.find(params[:id])
      artist_delete.destroy
---
SELECT "artists"."id" FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "QmFkIEJ1bm55"], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", "QmFkIEJ1bm55"]]