app/controllers/songs_controller.rb

SELECT "albums"."id" FROM "albums"
SELECT "songs"."id" FROM "songs"
SELECT "songs".* FROM "songs"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", "QWRlbWFzIGRlIG1pIHJlbWl4"], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "QWRlbWFzIGRlIG1p"], ["LIMIT", 1]]
UPDATE "songs" SET "times_played" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["times_played", 4], ["updated_at", "2021-05-01 21:51:44.281249"], ["id", "WW8gUGVycmVvIFNvbGE="]]
INSERT INTO "songs" ("id", "album_id", "name", "duration", "times_played", "artist_track", "album_track", "self_track", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_tracks

    if params[:name] != "" && params[:duration] != "" && params[:times_played] != ""
      album_id = params[:id]
      albumnes = Album.all.ids
      if albumnes.include?(album_id)
        name_track = params[:name].strip
        duration_track = params[:duration].to_i
        times_played = params[:times_played].to_i
        id_track = Base64.encode64(name_track).strip
        tracks = Song.all.ids
        if tracks.include?(id_track)
          render json: Song.find(id_track), status: 409
        else
          track = Song.new
          track.id = id_track
          track.album_id = album_id
          track.name = name_track
          track.duration = duration_track
          track.times_played = times_played
          track.artist_track = "artists/" + Album.find(album_id).artist_id
          track.album_track = "albums/" + album_id
          track.self_track = "tracks/" + id_track
          if track.save

SELECT "songs".* FROM "songs"
---
  def index
    songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", "TGEgU2FudGE="], ["LIMIT", 1]]
---
  def show
    only_song = Song.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", "WUhMUU1ETEc="], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = ?  [["album_id", "WUhMUU1ETEc="]]
---
  def show_album_tracks
    tracks = Album.find(params[:id]).songs

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "QmFkIEJ1bm55"], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", "QmFkIEJ1bm55"]]
---
  def show_artist_tracks
    albums = Artist.find(params[:id]).albums

SELECT "songs"."id" FROM "songs"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", "TGEgU2FudGE="], ["LIMIT", 1]]
UPDATE "songs" SET "times_played" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["times_played", 8], ["updated_at", "2021-05-02 17:36:27.563594"], ["id", "TGEgU2FudGE="]]
---
  def play
    tracks = Song.all.ids
    if tracks.include?(params[:id])
      track = Song.find(params[:id])
      track.times_played += 1
      track.save

SELECT "songs"."id" FROM "songs"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", "VHJpc3Rl"], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", "VHJpc3Rl"]]
---
  def delete
    tracks = Song.all.ids
    if tracks.include?(params[:id])
      song_delete = Song.find(params[:id])
      song_delete.destroy